In [1]:
import numpy as np 
import pandas as pd
import copy
#np --> numerical panda, es una llibreria per a realitzar càlcul numèric
#les notes de dawbio amb series
student_list=["John","Mary","Lucy","Peter"]
grades_list = [7,9,8,4]
wants_dual_list = [False,True,False,True]
datos: dict[list] = {"grade": grades_list,
                   "dual": wants_dual_list}
students_frame = pd.DataFrame(
    index=student_list,
    data = datos
)
students_frame

       grade   dual
John       7  False
Mary       9   True
Lucy       8  False
Peter      4   True

In [2]:
students_grades: pd.DataFrame = copy.deepcopy(students_frame)
#al index li fiquem un nom
students_grades.index.name = "name"
students_grades

       grade   dual
name
John       7  False
Mary       9   True
Lucy       8  False
Peter      4   True

In [3]:
#inplace matxaca el mateix dataFrame
#reset_index passa el index com columna
students_grades.reset_index(inplace=True)
students_grades

    name  grade   dual
0   John      7  False
1   Mary      9   True
2   Lucy      8  False
3  Peter      4   True

In [4]:
#borrem la columna
students_grades.drop(columns="dual", inplace=True)
students_grades

    name  grade
0   John      7
1   Mary      9
2   Lucy      8
3  Peter      4

In [5]:
students_grades.rename(columns={"name":"names"},inplace=True)
students_grades

   names  grade
0   John      7
1   Mary      9
2   Lucy      8
3  Peter      4

In [8]:
#Per ordenar les columnes com vols
students_grades = students_grades.loc[:, ["names","grade"]]
students_grades

   names  grade
0   John      7
1   Mary      9
2   Lucy      8
3  Peter      4

In [9]:
# SQL Like Joins
# Let's split the dataframe
students_grades: pd.DataFrame = (copy.deepcopy(students_frame)
                                    .reset_index()
                                    .rename(columns={"index":"name"})
                                    .drop(columns="dual")
                                    .loc[:,["name","grade"]]
                                    )
students_grades

    name  grade
0   John      7
1   Mary      9
2   Lucy      8
3  Peter      4

In [10]:
students_duals: pd.DataFrame = (copy.deepcopy(students_frame)
                                    .reset_index()
                                    .rename(columns={"index":"name"})
                                    .drop(columns="grade")
                                    .loc[:,["name","dual"]]
                                        )
students_duals

    name   dual
0   John  False
1   Mary   True
2   Lucy  False
3  Peter   True

In [11]:
#join with the 2 dataFrame
join: pd.DataFrame = pd.merge(students_grades,students_duals, on="name")
join

    name  grade   dual
0   John      7  False
1   Mary      9   True
2   Lucy      8  False
3  Peter      4   True

In [12]:
join.index = join.loc[:,"name"]
join.drop(columns=["name"], inplace=True)
join.index.name = ""
join

       grade   dual

John       7  False
Mary       9   True
Lucy       8  False
Peter      4   True

In [13]:
import numpy as np 
import pandas as pd
import copy
df3 = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)
df3

     A      B         C         D
0  foo    one -0.276289  0.472972
1  bar    one  0.401034 -0.404002
2  foo    two -0.540499  0.193975
3  bar  three -1.118954 -0.663413
4  foo    two -0.184771  0.343644
5  bar    two -0.379160 -0.817872
6  foo    one -0.006286  0.066400
7  foo  three -0.363200 -0.989204

In [14]:
df3_grouped = df3.groupby("A") #group by a colum(or more)
df3_grouped.groups #mostra les columnes que compleixien per cada valor de l'agrupació

{'bar': [1, 3, 5], 'foo': [0, 2, 4, 6, 7]}

In [15]:
df3_sum = df3_grouped.sum()
df3_sum #only numeric's columns

            C         D
A
bar -1.097080 -1.885287
foo -1.371045  0.087786

In [16]:
df3_groups = df3_grouped.groups

foo_rows = df3_groups['foo']
bar_roows = df3_groups['bar']

df3.loc[foo_rows, "C"]

0   -0.276289
2   -0.540499
4   -0.184771
6   -0.006286
7   -0.363200
Name: C, dtype: float64

In [17]:
df3.loc[foo_rows, "C"].sum()

-1.371044546986924

In [18]:
df3.loc[bar_roows,"D"].sum()

-1.885287403150349

In [19]:
df3.loc[bar_roows,"D"].max()

-0.4040022095405694

In [20]:
df3_grouped.cumcount()

0    0
1    0
2    1
3    1
4    2
5    2
6    3
7    4
dtype: int64